### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:45",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:35" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:35/invocations" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "35" -> (known after apply)
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "35" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7551965317977036745" -> (known after apply)
!       triggers = {
!           "timestamp" = "1692389315352453000" -> "1692396905616103000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:45" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-18T20:09:36.509+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:45" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/09fb9488701c5def1957559de0293b31b59719401dcf45b90ea3cd49faac86f5.zip" -> "builds/a52801a6930861cfa1424e9adca5241bc7d7c8b8058a401f6f276003f32f247d.zip"
!       s3_object_version           = "T05zgCdPLlrNt3ohpQu40F8qMd4FYSSO" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "ItsOQnBVG1+KDNey0RAjYGz+vBPP2L9SPQBtqyflaHo=" -> (known after apply)
!       source_code_size            = 29772318 -> (known after apply)
!       version                     = "45" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "a979c115ca27efca55c7c11720a41f59-6" -> (known after apply)
!       id                     = "builds/09fb9488701c5def1957559de0293b31b59719401dcf45b90ea3cd49faac86f5.zip" -> (known after apply)
!       key                    = "builds/09fb9488701c5def1957559de0293b31b59719401dcf45b90ea3cd49faac86f5.zip" -> "builds/a52801a6930861cfa1424e9adca5241bc7d7c8b8058a401f6f276003f32f247d.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/09fb9488701c5def1957559de0293b31b59719401dcf45b90ea3cd49faac86f5.zip" -> "builds/a52801a6930861cfa1424e9adca5241bc7d7c8b8058a401f6f276003f32f247d.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "T05zgCdPLlrNt3ohpQu40F8qMd4FYSSO" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/a52801a6930861cfa1424e9adca5241bc7d7c8b8058a401f6f276003f32f247d.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/a52801a6930861cfa1424e9adca5241bc7d7c8b8058a401f6f276003f32f247d.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2946463766937286392" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/09fb9488701c5def1957559de0293b31b59719401dcf45b90ea3cd49faac86f5.zip" -> "builds/a52801a6930861cfa1424e9adca5241bc7d7c8b8058a401f6f276003f32f247d.zip"
!           "timestamp" = "1692389316896460000" -> "1692396907195525800"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "7355301996861737039" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/09fb9488701c5def1957559de0293b31b59719401dcf45b90ea3cd49faac86f5.zip" -> "builds/a52801a6930861cfa1424e9adca5241bc7d7c8b8058a401f6f276003f32f247d.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 7 to add, 1 to change, 6 to destroy.
```
</details>